#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-gRFFqvzHfCRyvFgw

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Reading...
module.alerts.data.azurerm_subscription.current: Reading...
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
module.alerts.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
data.azuread_service_principal.current: Read complete after 1s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.OperationalInsights/workspaces/shared-laworkspace]
module.traffic-manager.azurerm_traffic_manager_profile.tm_profile: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
module.function.azurerm_app_service_plan.function_app_plan: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/serverFarms/traffic-switch-func-plan]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.secondary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.function.azurerm_storage_account.function_app_storage: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Storage/storageAccounts/trafficswitchfuncsa]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["secondary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/secondary-endpoint]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["primary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/primary-endpoint]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.function.azurerm_storage_container.function_code: Refreshing state... [id=https://trafficswitchfuncsa.blob.core.windows.net/function-releases]
module.function.azurerm_storage_blob.function_zip: Refreshing state... [id=https://trafficswitchfuncsa.blob.core.windows.net/function-releases/function-code.zip]
module.function.azurerm_function_app.function_app_python: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/sites/traffic-switch-func]
module.primary_monitoring.azurerm_monitor_action_group.failover: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-failover-func]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_postgresql_flexible_server.primary must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "primary" {
      ~ administrator_login           = "roadmap_maker_db" -> "adminuser" # forces replacement
      + administrator_password        = (sensitive value)
      ~ fqdn                          = "roadmap-maker-southeastasia-psql.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql" -> (known after apply)
        name                          = "roadmap-maker-southeastasia-psql"
      + private_dns_zone_id           = (known after apply)
      ~ storage_tier                  = "P4" -> (known after apply)
        tags                          = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (12 unchanged attributes hidden)

      ~ authentication {
          ~ password_auth_enabled         = false -> true
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_postgresql_flexible_server_database.primary must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "primary" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker" -> (known after apply)
        name      = "roadmap_maker"
      ~ server_id = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.aks_subnet must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "aks_subnet" {
      ~ id               = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet" -> (known after apply)
        name             = "AllowAKSSubnet"
      ~ server_id        = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.azure_services must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "azure_services" {
      ~ id               = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices" -> (known after apply)
        name             = "AllowAzureServices"
      ~ server_id        = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.primary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg"
        name                = "roadmap-maker-primary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyHTTPInbound"
              - priority                                   = 1010
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "80"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

  # module.primary_network.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "roadmap-maker-primary-vnet-nsg"
      + resource_group_name = "roadmap-maker-southeastasia-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "roadmap-maker"
          + "environment" = "prod"
          + "managed-by"  = "terraform"
          + "project"     = "cloudops-practice"
        }
    }

  # module.primary_network.azurerm_network_security_rule.inbound["3000"] will be created
  + resource "azurerm_network_security_rule" "inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3000"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-inbound-port-3000"
      + network_security_group_name = "roadmap-maker-primary-vnet-nsg"
      + priority                    = 3100
      + protocol                    = "Tcp"
      + resource_group_name         = "roadmap-maker-southeastasia-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.primary_network.azurerm_network_security_rule.inbound["80"] will be created
  + resource "azurerm_network_security_rule" "inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-inbound-port-80"
      + network_security_group_name = "roadmap-maker-primary-vnet-nsg"
      + priority                    = 180
      + protocol                    = "Tcp"
      + resource_group_name         = "roadmap-maker-southeastasia-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.secondary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg"
        name                = "roadmap-maker-secondary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyHTTPInbound"
              - priority                                   = 1010
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

  # module.secondary_network.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastasia"
      + name                = "roadmap-maker-secondary-vnet-nsg"
      + resource_group_name = "roadmap-maker-eastasia-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "roadmap-maker"
          + "environment" = "prod"
          + "managed-by"  = "terraform"
          + "project"     = "cloudops-practice"
        }
    }

  # module.secondary_network.azurerm_network_security_rule.inbound["3000"] will be created
  + resource "azurerm_network_security_rule" "inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3000"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-inbound-port-3000"
      + network_security_group_name = "roadmap-maker-secondary-vnet-nsg"
      + priority                    = 3100
      + protocol                    = "Tcp"
      + resource_group_name         = "roadmap-maker-eastasia-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.secondary_network.azurerm_network_security_rule.inbound["80"] will be created
  + resource "azurerm_network_security_rule" "inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-inbound-port-80"
      + network_security_group_name = "roadmap-maker-secondary-vnet-nsg"
      + priority                    = 180
      + protocol                    = "Tcp"
      + resource_group_name         = "roadmap-maker-eastasia-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

Plan: 10 to add, 2 to change, 4 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.function.azurerm_app_service_plan.function_app_plan,
│   on modules/function/main.tf line 23, in resource "azurerm_app_service_plan" "function_app_plan":
│   23: resource "azurerm_app_service_plan" "function_app_plan" {
│ 
│ The `azurerm_app_service_plan` resource has been superseded by the
│ `azurerm_service_plan` resource. Whilst this resource will continue to be
│ available in the 2.x and 3.x releases it is feature-frozen for
│ compatibility purposes, will no longer receive any updates and will be
│ removed in a future major release of the Azure Provider.
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: expected priority to be in the range (100 - 4096), got 5237
│ 
│   with module.primary_network.azurerm_network_security_rule.inbound["5137"],
│   on modules/network/main.tf line 85, in resource "azurerm_network_security_rule" "inbound":
│   85:   priority                    = 100 + tonumber(each.value)
│ 
╵
Operation failed: failed running terraform plan (exit 1)
::error::Terraform exited with code 1.

```

</details>

*Pushed by: @AndrewDoan01, Action: `pull_request`*